namespace Libraries.DescriptionOfObjects.Parameters;

public static class Sizes
{
    /// <summary>
    ///     Типоразмер вентилятора для OsuDu: короткое название
    /// </summary>
    public static readonly double[] ValuesForOsuDu =
    {
        400,
        //425,
        450,
        //475,
        500,
        //530,
        560,
        //600,
        630,
        //670,
        710,
        //750,
        800,
        //850,
        900,
        //950,
        1000,
        //1060,
        1120,
        //1180,
        1250
    };

    /// <summary>
    ///     Типоразмер вентилятора для OsuDu: полное название
    /// </summary>
    public static readonly string[] NamesForOsuDu =
    {
        "400",
        "450",
        "500",
        "560",
        "630",
        "710",
        "800",
        "900",
        "1000",
        "1120",
        "1250"
    };

    /// <summary>
    ///     Типоразмер вентилятора для EuFan: короткое название
    /// </summary>
    public static readonly double[] ValuesForEuFan =
    {
        //100,
        //106,
        //112,
        //118,
        //125,
        //132,
        //140,
        //150,
        //160,
        //170,
        //180,
        //190,
        //200,
        //212,
        224,
        //236,
        250,
        //265,
        280,
        //300,
        315,
        //335,
        355,
        //375,
        400,
        //425,
        450,
        //475,
        500,
        //530,
        560,
        //600,
        630,
        //670,
        710,
        //750,
        800,
        //850,
        900,
        //950,
        1000,
        //1060,
        1120,
        //1180,
        1250,
        //1320,
        1400
    };

    /// <summary>
    ///     Типоразмер вентилятора для EuFan: полное название
    /// </summary>
    public static readonly string[] NamesForEuFan =
    {
        "224",
        "250",
        "280",
        "315",
        "355",
        "400",
        "450",
        "500",
        "560",
        "630",
        "710",
        "800",
        "900",
        "1000",
        "1120",
        "1250",
        "1400"
    };
}
